#ifndef PLL_H
#define PLL_H

#include <MC9S12XS128.h>

/**********************************************************************
Ñ¡ÔñSYNR_SETµÄÖµ£¬ÉèÖÃ×ÜÏßÆµÂÊ£¬¼ÆËã¹«Ê½£S£¨SYNR_SET+1£©*16M/£¨REFDV+1£
ÕâÀïREFDV = 1;
**********************************************************************/

#define SYNR_SET   0xc5    
                        //0x02-----24M×ÜÏßÆµÂÊ
                        //0x43-----32M×ÜÏßÆµÂÊ
                        //0x44-----40M×ÜÏßÆµÂÊ
                        //0xc5-----48M×ÜÏßÆµÂÊ
                        //0xc6-----56M×ÜÏßÆµÂÊ
                        //0xc7-----64M×ÜÏßÆµÂÊ
                        //0xc8-----72M×ÜÏßÆµÂÊ
                        //0xc9-----80M×ÜÏßÆµÂÊ
                        //0xca-----88M×ÜÏßÆµÂÊ
                        //0xcb-----96M×ÜÏßÆµÂÊ
                        
                        //0xcc-----104M×ÜÏßÆµÂÊ
                        //0xcd-----112M×ÜÏßÆµÂÊ
                        //0xce-----120M×ÜÏßÆµÂÊ
/*==================================================================*/ 
                       
void Pll_Init(void);

#endif





























